app/views/devices/_device_location_fields.html.erb

      <%= f.label :location_id, "Location Name" %><br />
      <%= f.collection_select(:location_id, Location.all, :id, :location_name, :prompt => true) %>
---
SELECT `locations`.* FROM `locations`

      <%= f.label :patient_id, "Patient" %><br />
      <%= f.collection_select(:patient_id, Patient.all, :id, :patient_full_name, :prompt => true) %>
---
SELECT `patients`.* FROM `patients`