app/views/users/index.html.erb

  <tr>
    <td><%= user.group.group_name %></td>
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1