app/views/practices/_location_fields.html.erb

      <%= f.label :location_type_id %><br />
      <%= f.collection_select(:location_type_id, LocationType.all, :id, :location_type, :prompt => true) %>
---
SELECT `location_types`.* FROM `location_types`