app/controllers/devices_controller.rb

SELECT `devices`.* FROM `devices`
---
  def index
    @devices = Device.all