app/controllers/devices_controller.rb

SELECT COUNT(*) FROM `devices`
SELECT `devices`.* FROM `devices` ORDER BY serial_number LIMIT 20 OFFSET 0
---
  def index
    @devices = Device.order("serial_number").page(params[:page]).per(20)

SELECT `devices`.* FROM `devices` WHERE `devices`.`id` = 1 LIMIT 1
---
  def show
    @device = Device.find(params[:id])

SELECT `devices`.* FROM `devices` WHERE `devices`.`id` = 5 LIMIT 1
---
  def edit
    @device = Device.find(params[:id])