app/controllers/disposables_controller.rb

SELECT `disposables`.* FROM `disposables`
---
  def index
    @disposables = Disposable.all

SELECT `disposables`.* FROM `disposables` WHERE `disposables`.`id` = 1 LIMIT 1
---
  def show
    @disposable = Disposable.find(params[:id])

SELECT `disposables`.* FROM `disposables` WHERE `disposables`.`id` = 1 LIMIT 1
---
  def edit
    @disposable = Disposable.find(params[:id])

SELECT `disposables`.* FROM `disposables` WHERE `disposables`.`id` = 1 LIMIT 1
---
  def destroy
    @disposable = Disposable.find(params[:id])