app/controllers/practices_controller.rb

SELECT `practices`.* FROM `practices`
---
  def index
    @practices = Practice.all

SELECT `practices`.* FROM `practices` WHERE `practices`.`id` = 4 LIMIT 1
---
  def show
    @practice = Practice.find(params[:id])

SELECT `practices`.* FROM `practices` WHERE `practices`.`id` = 4 LIMIT 1
---
  def edit
    @practice = Practice.find(params[:id])