app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def password
    @user = User.find(params[:id])

INSERT INTO `users` (`active`, `created_at`, `email`, `first_name`, `group_id`, `last_name`, `password_hash`, `password_salt`, `updated_at`, `username`) VALUES (1, '2011-11-15 15:43:27', 'pcreech@rmddx.com', 'Paula', 2, 'Creech', '$2a$10$4remxLL8x3y4kct.HW1lAOyLZpqT9z2VL6AR/3QhRV6YwZxcGGb4m', '$2a$10$4remxLL8x3y4kct.HW1lAO', '2011-11-15 15:43:27', 'pcreech')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `password_salt` = '$2a$10$wBMw90uLbfGHQ//FkWJp1u', `password_hash` = '$2a$10$wBMw90uLbfGHQ//FkWJp1uykPQShXOBMITSU9mVmto3asoSE4yN1m', `updated_at` = '2011-11-16 02:42:10' WHERE `users`.`id` = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])